In [1]:
# Import all necessary libraries required for data analysis
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# Read dataset
df=pd.read_csv('data_emission.csv')
df

            Entity Code  Year  Annual CO2 emissions (tonnes )
0      Afghanistan  AFG  1949                        14656.00
1      Afghanistan  AFG  1950                        84272.00
2      Afghanistan  AFG  1951                        91600.00
3      Afghanistan  AFG  1952                        91600.00
4      Afghanistan  AFG  1953                       106256.00
...            ...  ...   ...                             ...
20848     Zimbabwe  ZWE  2013                     11536239.29
20849     Zimbabwe  ZWE  2014                     11866348.41
20850     Zimbabwe  ZWE  2015                     10907603.94
20851     Zimbabwe  ZWE  2016                      9932649.88
20852     Zimbabwe  ZWE  2017                     10397718.47

[20853 rows x 4 columns]

In [3]:
df.head()

        Entity Code  Year  Annual CO2 emissions (tonnes )
0  Afghanistan  AFG  1949                         14656.0
1  Afghanistan  AFG  1950                         84272.0
2  Afghanistan  AFG  1951                         91600.0
3  Afghanistan  AFG  1952                         91600.0
4  Afghanistan  AFG  1953                        106256.0

# Understanding Dataset

In [4]:
df.shape

(20853, 4)

In [6]:
df['Entity'].value_counts()

Entity
Statistical differences      267
Asia and Pacific (other)     267
EU-28                        267
Europe (other)               267
Americas (other)             267
                            ...
Antarctic Fisheries           21
Wallis and Futuna Islands     17
Timor                         16
Christmas Island              14
Liechtenstein                 11
Name: count, Length: 233, dtype: int64

In [7]:
df['Year'].value_counts()

Year
2007    230
2002    229
2010    229
2003    229
2004    229
       ...
1775     13
1774     13
1773     13
1772     13
1752     13
Name: count, Length: 267, dtype: int64

In [9]:
df.nunique()

Entity                              233
Code                                222
Year                                267
Annual CO2 emissions (tonnes )    13092
dtype: int64

In [10]:
df.isnull().sum()

Entity                               0
Code                              2207
Year                                 0
Annual CO2 emissions (tonnes )       0
dtype: int64

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20853 entries, 0 to 20852
Data columns (total 4 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Entity                          20853 non-null  object
 1   Code                            18646 non-null  object
 2   Year                            20853 non-null  int64
 3   Annual CO2 emissions (tonnes )  20853 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 651.8+ KB

In [12]:
df.drop('Code',axis='columns',inplace=True)

In [13]:
df

            Entity  Year  Annual CO2 emissions (tonnes )
0      Afghanistan  1949                        14656.00
1      Afghanistan  1950                        84272.00
2      Afghanistan  1951                        91600.00
3      Afghanistan  1952                        91600.00
4      Afghanistan  1953                       106256.00
...            ...   ...                             ...
20848     Zimbabwe  2013                     11536239.29
20849     Zimbabwe  2014                     11866348.41
20850     Zimbabwe  2015                     10907603.94
20851     Zimbabwe  2016                      9932649.88
20852     Zimbabwe  2017                     10397718.47

[20853 rows x 3 columns]

In [14]:
df=df.rename(columns={'Entity':'Country','Annual CO2 emissions (tonnes )':'Emission(tones)'})
df

           Country  Year  Emission(tones)
0      Afghanistan  1949         14656.00
1      Afghanistan  1950         84272.00
2      Afghanistan  1951         91600.00
3      Afghanistan  1952         91600.00
4      Afghanistan  1953        106256.00
...            ...   ...              ...
20848     Zimbabwe  2013      11536239.29
20849     Zimbabwe  2014      11866348.41
20850     Zimbabwe  2015      10907603.94
20851     Zimbabwe  2016       9932649.88
20852     Zimbabwe  2017      10397718.47

[20853 rows x 3 columns]

# Analysis of Data

In [15]:
df.head()

       Country  Year  Emission(tones)
0  Afghanistan  1949          14656.0
1  Afghanistan  1950          84272.0
2  Afghanistan  1951          91600.0
3  Afghanistan  1952          91600.0
4  Afghanistan  1953         106256.0

In [17]:
df.Year.min()

1751

In [18]:
df.Year.max()

2017

In [29]:
print(round((df['Emission(tones)'].min())/1000000,2),"Millions")

-625.52 Millions

In [30]:
print(round((df['Emission(tones)'].max())/1000000,2),"Millions")

36153.26 Millions

In [33]:
df[df['Emission(tones)']<0]

                       Country  Year  Emission(tones)
17598  Statistical differences  1971    -2.937795e+07
17599  Statistical differences  1972    -1.327650e+08
17600  Statistical differences  1973    -1.219746e+08
17601  Statistical differences  1974    -1.784734e+07
17602  Statistical differences  1975    -9.373611e+07
17603  Statistical differences  1976    -1.300720e+07
17605  Statistical differences  1978    -4.183775e+08
17607  Statistical differences  1980    -9.108704e+06
17608  Statistical differences  1981    -8.579989e+07
17609  Statistical differences  1982    -1.104366e+08
17610  Statistical differences  1983    -3.578849e+08
17611  Statistical differences  1984    -2.415858e+08
17612  Statistical differences  1985    -3.607281e+08
17613  Statistical differences  1986    -4.802771e+07
17614  Statistical differences  1987    -2.723048e+08
17615  Statistical differences  1988    -3.152396e+08
17616  Statistical differences  1989    -1.878203e+08
17617  Statistical differences  1990    -5.814990e+08
17618  Statistical differences  1991    -3.117070e+08
17619  Statistical differences  1992    -3.206405e+08
17620  Statistical differences  1993    -6.039042e+08
17621  Statistical differences  1994    -3.829234e+08
17622  Statistical differences  1995    -4.152905e+08
17623  Statistical differences  1996    -6.014068e+08
17624  Statistical differences  1997    -3.352780e+08
17625  Statistical differences  1998    -1.976861e+08
17626  Statistical differences  1999    -5.657580e+08
17627  Statistical differences  2000    -6.255223e+08
17628  Statistical differences  2001    -2.711537e+08
17629  Statistical differences  2002    -4.706956e+08
17630  Statistical differences  2003    -3.640166e+08
17631  Statistical differences  2004    -3.255337e+08
17632  Statistical differences  2005    -2.123722e+08
17633  Statistical differences  2006    -1.652091e+08
17634  Statistical differences  2007    -4.886405e+08
17635  Statistical differences  2008    -2.048367e+08
17636  Statistical differences  2009    -1.036986e+08
17637  Statistical differences  2010    -1.720100e+08
17638  Statistical differences  2011    -6.031251e+07
17639  Statistical differences  2012    -1.774597e+06

In [35]:
df['Emission(tones)']=df['Emission(tones)'].where(df['Emission(tones)']>=0,0)

In [36]:
df[df['Emission(tones)']<0]

Empty DataFrame
Columns: [Country, Year, Emission(tones)]
Index: []

In [37]:
print(round((df['Emission(tones)'].min())/1000000,2),"Millions")

0.0 Millions

In [42]:
df.groupby(['Country'])['Emission(tones)'].sum().sort_values()

Country
Kyrgysztan                  0.000000e+00
Antarctic Fisheries         1.538880e+05
Tuvalu                      2.569226e+05
Niue                        2.715786e+05
Saint Helena                3.463088e+05
                                ...
Asia and Pacific (other)    1.780573e+11
China                       2.001365e+11
EU-28                       3.528583e+11
United States               3.993783e+11
World                       1.575244e+12
Name: Emission(tones), Length: 233, dtype: float64